#include <stdio.h>

int main() {
    int a[2][3][5] = {
        {
            {1,2,3,4,5},
            {6,7,8,9,10},
            {11,12,13,14,15}
        },
        {
            {16,17,18,19,20},
            {21,22,23,24,25},
            {26,27,28,29,30}
        }
    };

    printf("%d\n", a); //3차원 배열인 a의 주소를 가르키는 포인터 (ex. 100번지)
    printf("%d\n", *a); //해당 3차원 배열의 처음 주소, 100번지
    printf("%d\n", **a); //해당 3차원 배열의 처음 주소, 100번지
    printf("%d\n", ***(a+1)); //16 
    printf("%d\n", **(*a+1)); //6

    printf("%d\n", (*(*(*a+1)))); //16 -> WRONG!, 6
    printf("%d\n", (*(*(*a+1)+2)+3)); //29 -> WRONG!, 11, why? 8 + 3 = 11
    printf("%d\n", (*(**a+2))); //11 -> WRONG!, 3
    printf("%d\n", (*(**(a+1)+2))); //18 (16+2)

    //설명 - https://www.youtube.com/watch?v=zzlCG5DEp3o

    return 0;
}