#include <stdio.h>

int main() {
    int x = 0x15213F10 >> 4; //0x = 16진수. 0~9, A(10), B(11), C(12), D(13), E(14), F(15)
                             // 1: 0001 
                             // 2: 0010 
                             // 3: 0011
                             // 4: 0100
                             // 5: 0101 
                             // 6: 0110
                             // 7: 0111
                             // 8: 1000
                             // 9: 1001
                             // A: 1010
                             // B: 1011
                             // C: 1100
                             // D: 1101
                             // E: 1110
                             // F: 1111
                             //1. 원본: 15213 '15' 10 (각 자리수당 16진수라 1~15)
                             //2. >> 4 -> 01523 '15' 1
                             //3. 0x015213F1
    char y = (char)x; //int는 4byte, char은 1byte -> 맨 오른쪽에 1 byte(8 bit)만 떼서 char로 변환. 
                      //x: 1111 0001 
                      //(1 byte, sizeof(char)) 
                      //unsigned가 아니라, 맨 앞에 1이 붙으면 마이너스 처리. (%d)
                      //맨 앞에 1이니까 마이너스, -128~127 
                      //0000 0000 = 0
                      //1111 1111 = -1
                      //1111 1110 = -2
                      //1111 0001 = -15
    unsigned char z = (unsigned char)x; //unsigned = 맨 앞 1을 음수로 안치겠다는 것. 0~255. 
                                        //x: 1111 0001 
                                        //1 + 16 + 32 + 64 + 128 = 241
    printf("%d, %d, %u", x, y, z); //22156283, -15, 241

    return 0;
}